import { CardData } from "../types";

import img1 from "../../public/imgs/img1.jpg";
import img2 from "../../public/imgs/img2.jpeg";
import img3 from "../../public/imgs/img3.jpg";
import img4 from "../../public/imgs/img4.jpg";
import img5 from "../../public/imgs/img5.jpg";
import img6 from "../../public/imgs/img6.jpg";
import img7 from "../../public/imgs/img7.jpg";
import img8 from "../../public/imgs/img8.jpg";
import img9 from "../../public/imgs/img9.jpg";
import img10 from "../../public/imgs/img10.jpg";


const data: CardData = [
    {
        img: img1,
        name: "มาชูปิกชู",
        description: "เมืองโบราณของชาวอินคา ตั้งอยู่บนเทือกเขาสูงในเทือกเขาแอนดีส ล้อมรอบด้วยทิวทัศน์ธรรมชาติอันงดงาม เต็มไปด้วยเรื่องราวลึกลับ น่าค้นหา",
    },
    {
        img: img2,
        name: "ทัชมาฮาล",
        description: "mausoleum หินอ่อนสีขาว สถาปัตยกรรมสุดอลังการ สร้างขึ้นโดยจักรพรรดิ์มูฮัมหมัด ชาห์ เพื่อเป็นสุสานฝังศพของพระมเหสี มุมตาซ มาฮาล",
    },
    {
        img: img3,
        name: "ซากราดา ฟามิเลีย",
        description: " โบสถ์โรมันคาทอลิก ผลงานการออกแบบของอันโตนี เกาดี สถาปัตยกรรมสไตล์โมเดิร์น เต็มไปด้วยรายละเอียดอันประณีต งดงาม",
    },
    {
        img: img4,
        name: "พีระมิด",
        description: "พีระมิดโบราณ สิ่งมหัศจรรย์ของโลกยุคโบราณ สร้างขึ้นเพื่อเป็นสุสานฝังศพของฟาโรห์ เต็มไปด้วยเรื่องราวลึกลับ น่าค้นหา",
    },
    {
        img: img5,
        name: "มหาวิหารเซนต์เบซิล",
        description: "มหาวิหารเก่าแก่ สัญลักษณ์ของกรุงมอสโก สถาปัตยกรรมแบบรัสเซียน สไตล์โดมหัวหอม  เต็มไปด้วยสีสัน ลวดลาย สวยงาม",
    },
    {
        img: img6,
        name: "นครวัด",
        description: "ศาสนสถานฮินดูที่ใหญ่ที่สุดในโลก สร้างขึ้นเพื่อเป็นเทวสถานของพระวิษณุ สถาปัตยกรรมแบบเขมรโบราณ  เต็มไปด้วยความยิ่งใหญ่ อลังการ",
    },
    {
        img: img7,
        name: "โคลอสเซียม",
        description: "สนามกีฬาโบราณ สร้างขึ้นเพื่อใช้สำหรับการต่อสู้ของกลาดิเอเตอร์ สถาปัตยกรรมโรมันโบราณ  เต็มไปด้วยเรื่องราวทางประวัติศาสตร์",
    },
    {
        img: img8,
        name: "หอไอเฟล",
        description: "หอคอยเหล็กสูงเสียดฟ้า สัญลักษณ์ของกรุงปารีส  ชมวิวเมืองปารีสแบบพาโนรามา  โรแมนติก สวยงาม",
    },
    {
        img: img9,
        name: "แกรนด์แคนยอน",
        description: "หุบเขาขนาดมหึมา เกิดขึ้นจากการกัดเซาะของแม่น้ำโคโลราโด  เต็มไปด้วยทิวทัศน์ธรรมชาติอันงดงาม แปลกตา น่าทึ่ง",
    },
    {
        img: img10,
        name: "แสงเหนือ",
        description: "ปรากฏการณ์ทางธรรมชาติ แสงสีต่างๆ บนท้องฟ้า เกิดขึ้นบริเวณขั้วโลก  เต็มไปด้วยความสวยงาม ลึกลับ น่าตื่นตาตื่นใจ",
    },
];

export const randomFunc = (n: number =  5): number => {
    return parseFloat((Math.random() * n).toFixed(1));
}

export default data;